enum message{
    twosol = 0,
    onesol = 1,
    infsol = 2,
    nosol = 3
};

//-----------------------------------------------------------------------------------
//! Решает кваратные уравнения ax^2+bx+c=0
//!
//! @param[in] a a-коэффицент
//! @param[in] b b-коэффицент
//! @param[in] c c-коэффицент
//! @param[out] x1 Указатель на первое решение
//! @param[out] x2 Указатель на второе решение
//! @param[out] N указатель на номер сообщения о кол-ве корней
//-----------------------------------------------------------------------------------

void solutionsquare (double a, double b, double c, double *x1,  double *x2, int *N);

//-----------------------------------------------------------------------------------
//! Решает линейные уравнения bx+c=0
//!
//! @param[in] b b-коэффицент
//! @param[in] c c-коэффицент
//! @param[out] x1 Указатель на решение
//! @param[out] N указатель на номер сообщения о кол-ве корней
//-----------------------------------------------------------------------------------

void solutionline (double b, double c, double *x1, int *N);

//-----------------------------------------------------------------------------------
//! Функция для ввода трех переременных типа double
//!
//! @param[out] a Указатель на первое число
//! @param[out] b Указатель на второе число
//! @param[out] c Указатель на третье число
//-----------------------------------------------------------------------------------

void input (double *a, double *b, double *c);

//-----------------------------------------------------------------------------------
//! Функция для вывода сообщения о корнях
//!
//! @param[in] N номер сообщения
//! @param[in] x1 первый корень
//! @param[in] x2 второй корень
//-----------------------------------------------------------------------------------

void output (int n, double x1, double x2);

//-----------------------------------------------------------------------------------
//! Функция для считывания числа типа double с консоли с проверкой ввода
//!
//! @param[out] a Указатель на переменную, в которую вводится число
//-----------------------------------------------------------------------------------

void getdouble (double *a);

//-----------------------------------------------------------------------------------
//! Функция для очистки буфера ввода
//-----------------------------------------------------------------------------------

void clean();

//-----------------------------------------------------------------------------------
//! Функция для проверки верности работы функции solutionline
//-----------------------------------------------------------------------------------

void testsolutionline();

//-----------------------------------------------------------------------------------
//! Функция для проверки верности работы функции solutionsquare
//-----------------------------------------------------------------------------------

void testsolutionsquare();

//-----------------------------------------------------------------------------------
//! Функция для комплексной проверки функций ssolutionline и solutionsquare
//-----------------------------------------------------------------------------------

void testsquaresolver();
