enum MESSAGE_SOLUTION{
    TWOSOL = 0,
    ONESOL = 1,
    INFSOL = 2,
    NOSOL = 3
};

enum DOUBLE_COMPARSION{
    EQUAL = 0,
    FIRSTLARGER = 1,
    SECONDLARGER = 2
};

//-----------------------------------------------------------------------------------
//! Решает кваратные уравнения ax^2+bx+c=0
//!
//! @param[in] a a-коэффицент
//! @param[in] b b-коэффицент
//! @param[in] c c-коэффицент
//! @param[out] x1 Указатель на первое решение
//! @param[out] x2 Указатель на второе решение
//! @return Количество корней
//-----------------------------------------------------------------------------------

int solutionsquare (double a, double b, double c, double *x1, double *x2);

//-----------------------------------------------------------------------------------
//! Решает линейные уравнения bx+c=0
//!
//! @param[in] b b-коэффицент
//! @param[in] c c-коэффицент
//! @param[out] x1 Указатель на решение
//! @return КОличество корней
//-----------------------------------------------------------------------------------

int solutionline (double b, double c, double *x1);

//-----------------------------------------------------------------------------------
//! Функция для ввода трех переременных типа double
//!
//! @param[out] a Указатель на первое число
//! @param[out] b Указатель на второе число
//! @param[out] c Указатель на третье число
//-----------------------------------------------------------------------------------

void input (double *a, double *b, double *c);

//-----------------------------------------------------------------------------------
//! Функция для вывода сообщения о корнях
//!
//! @param[in] SolCount номер сообщения
//! @param[in] x1 первый корень
//! @param[in] x2 второй корень
//-----------------------------------------------------------------------------------

void output (int n, double x1, double x2);

//-----------------------------------------------------------------------------------
//! Функция для сравнивания чисел типа double
//!
//! @param[out] a Указатель на переменную, в которую вводится число
//-----------------------------------------------------------------------------------

int DCompare (double a, double b);

//-----------------------------------------------------------------------------------
//! Функция для считывания числа типа double с консоли с проверкой ввода
//!
//! @param[in] a первое число
//! @param[in] b второе число
//!
//! @return Число, отвечающее за то, какое из введенных чисел больше
//-----------------------------------------------------------------------------------

void getdouble (double *a);

//-----------------------------------------------------------------------------------
//! Функция для очистки буфера ввода
//-----------------------------------------------------------------------------------

void clean();

//-----------------------------------------------------------------------------------
//! Функция для проверки верности работы функции solutionline
//-----------------------------------------------------------------------------------

void testsolutionline();

//-----------------------------------------------------------------------------------
//! Функция для проверки верности работы функции solutionsquare
//-----------------------------------------------------------------------------------

void testsolutionsquare();

//-----------------------------------------------------------------------------------
//! Функцкия для комплексной проверки функций ssolutionline и solutionsquare
//-----------------------------------------------------------------------------------

void testsquaresolver();
